_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 198, 198, 32)      896       
_________________________________________________________________
activation_19 (Activation)   (None, 198, 198, 32)      0         
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 99, 99, 32)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 97, 97, 32)        9248      
_________________________________________________________________
activation_20 (Activation)   (None, 97, 97, 32)        0         
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 48, 48, 32)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 46, 46, 64)        18496     
_________________________________________________________________
activation_21 (Activation)   (None, 46, 46, 64)        0         
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 23, 23, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 21, 21, 128)       73856     
_________________________________________________________________
activation_22 (Activation)   (None, 21, 21, 128)       0         
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 10, 10, 128)       0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 12800)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 64)                819264    
_________________________________________________________________
activation_23 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_10 (Dense)             (None, 1)                 65        
_________________________________________________________________
activation_24 (Activation)   (None, 1)                 0         
=================================================================
Total params: 921,825
Trainable params: 921,825
Non-trainable params: 0
_________________________________________________________________
