_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_38 (Conv2D)           (None, 198, 198, 32)      896       
_________________________________________________________________
activation_58 (Activation)   (None, 198, 198, 32)      0         
_________________________________________________________________
max_pooling2d_38 (MaxPooling (None, 99, 99, 32)        0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 97, 97, 64)        18496     
_________________________________________________________________
activation_59 (Activation)   (None, 97, 97, 64)        0         
_________________________________________________________________
max_pooling2d_39 (MaxPooling (None, 48, 48, 64)        0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 46, 46, 128)       73856     
_________________________________________________________________
activation_60 (Activation)   (None, 46, 46, 128)       0         
_________________________________________________________________
max_pooling2d_40 (MaxPooling (None, 23, 23, 128)       0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 67712)             0         
_________________________________________________________________
dense_21 (Dense)             (None, 64)                4333632   
_________________________________________________________________
activation_61 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_22 (Dense)             (None, 1)                 65        
_________________________________________________________________
activation_62 (Activation)   (None, 1)                 0         
=================================================================
Total params: 4,426,945
Trainable params: 4,426,945
Non-trainable params: 0
_________________________________________________________________
