_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_35 (Conv2D)           (None, 198, 198, 32)      896       
_________________________________________________________________
activation_53 (Activation)   (None, 198, 198, 32)      0         
_________________________________________________________________
max_pooling2d_35 (MaxPooling (None, 99, 99, 32)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 97, 97, 64)        18496     
_________________________________________________________________
activation_54 (Activation)   (None, 97, 97, 64)        0         
_________________________________________________________________
max_pooling2d_36 (MaxPooling (None, 48, 48, 64)        0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 46, 46, 128)       73856     
_________________________________________________________________
activation_55 (Activation)   (None, 46, 46, 128)       0         
_________________________________________________________________
max_pooling2d_37 (MaxPooling (None, 23, 23, 128)       0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 67712)             0         
_________________________________________________________________
dense_19 (Dense)             (None, 64)                4333632   
_________________________________________________________________
activation_56 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_20 (Dense)             (None, 1)                 65        
_________________________________________________________________
activation_57 (Activation)   (None, 1)                 0         
=================================================================
Total params: 4,426,945
Trainable params: 4,426,945
Non-trainable params: 0
_________________________________________________________________
